{
  "backend": {
    "Keeled": [
      {
        "name": "JavaScript ",
        "description": "JavaScript is a versatile, high-level programming language primarily used for adding interactivity and dynamic features to websites. It runs in the browser, allowing for client-side scripting that can manipulate HTML and CSS, respond to user events, and interact with web APIs. JavaScript is also used on the server side with environments like Node.js, enabling full-stack development. It supports event-driven, functional, and imperative programming styles, and has a rich ecosystem of libraries and frameworks (like React, Angular, and Vue) that enhance its capabilities and streamline development.",
        "video_url": "https://www.youtube.com/watch?v=hdI2bqOjy3c&t=2s"
      }
    ],
    "Versiooni kontroll": [
      {
        "name": "Git ",
        "description": "Git is a distributed version control system designed to handle projects of any size with speed and efficiency. Created by Linus Torvalds in 2005, it tracks changes in source code during software development, allowing multiple developers to work together on non-linear development. Git maintains a complete history of all changes, enabling easy rollbacks and comparisons between versions. Its distributed nature means each developer has a full copy of the repository, allowing for offline work and backup. Git’s key features include branching and merging capabilities, staging area for commits, and support for collaborative workflows like pull requests. Its speed, flexibility, and robust branching and merging capabilities have made it the most widely used version control system in software development, particularly for open-source projects and team collaborations.",
        "video_url": "https://www.youtube.com/watch?v=SWYqp7iY_Tc"
      }
    ],
    "Repo hostimisteenus": [
      {
        "name": "Github ",
        "description": "GitHub is a web-based platform for version control and collaboration using Git. Owned by Microsoft, it provides hosting for software development and offers features beyond basic Git functionality. GitHub includes tools for project management, code review, and social coding. Key features include repositories for storing code, pull requests for proposing and reviewing changes, issues for tracking bugs and tasks, and actions for automating workflows. It supports both public and private repositories, making it popular for open-source projects and private development. GitHub’s collaborative features, like forking repositories and inline code comments, facilitate team development and community contributions. With its extensive integrations and large user base, GitHub has become a central hub for developers, serving as a portfolio, collaboration platform, and deployment tool for software projects of all sizes.",
        "video_url": "https://www.youtube.com/watch?v=RGOj5yH7evk"
      }
    ],
    "Andmebaas": [
      {
        "name": "PostgreSQL ",
        "description": "PostgreSQL is an advanced, open-source relational database management system (RDBMS) known for its robustness, extensibility, and standards compliance. It supports a wide range of data types and advanced features, including complex queries, foreign keys, and full-text search. PostgreSQL is highly extensible, allowing users to define custom data types, operators, and functions. It supports ACID (Atomicity, Consistency, Isolation, Durability) properties for reliable transaction processing and offers strong support for concurrency and data integrity. Its capabilities make it suitable for various applications, from simple web apps to large-scale data warehousing and analytics solutions.",
        "video_url": "https://www.youtube.com/watch?v=SpfIwlAYaKk"
      }
    ],
    "Õpi API kohta ": [
      {
        "name": "JSON APId ",
        "description": "JSON or JavaScript Object Notation is an encoding scheme that is designed to eliminate the need for an ad-hoc code for each application to communicate with servers that communicate in a defined way. JSON API module exposes an implementation for data stores and data structures, such as entity types, bundles, and fields.",
        "video_url": "https://www.youtube.com/watch?v=N-4prIh7t38"
      }
    ],
    "Testimine": [
      {
        "name": "Integratsiooni testid ",
        "description": "Integration testing focuses on verifying the interactions between different components or modules of a software system to ensure they work together as expected. It comes after unit testing and tests how modules communicate with each other, often using APIs, databases, or third-party services. The goal is to catch issues related to the integration points, such as data mismatches, protocol errors, or misconfigurations. Integration tests help ensure that independently developed components can function seamlessly as part of a larger system, making them crucial for identifying bugs that wouldn’t surface in isolated unit test",
        "video_url": "https://www.youtube.com/watch?v=kRD6PA6uxiY"
      },
      {
        "name": "Üksuse testid",
        "description": "Unit testing is a software testing method where individual components or units of a program are tested in isolation to ensure they function correctly. This approach focuses on verifying the smallest testable parts of an application, such as functions or methods, by executing them with predefined inputs and comparing the results to expected outcomes. Unit tests are typically automated and written by developers during the coding phase to catch bugs early, facilitate code refactoring, and ensure that each unit of code performs as intended. By isolating and testing each component, unit testing helps improve code reliability and maintainability.",
        "video_url": "https://www.youtube.com/watch?v=W2KOSaetWBk"
      },
      {
        "name": "Funktsionaalsuse testid",
        "description": "Functional testing is where software is tested to ensure functional requirements are met. Usually, it is a form of black box testing in which the tester has no understanding of the source code; testing is performed by providing input and comparing expected/actual output. It contrasts with non-functional testing, which includes performance, load, scalability, and penetration testing.",
        "video_url": "https://www.youtube.com/watch?v=NgQT7miTP9M"
      }
    ]
  },
  "frontend": {
    "Keeled": [
      {
        "name": "HTML",
        "description": "HTML (HyperText Markup Language) is the standard markup language for creating web pages. It describes the structure of a webpage and is used to organize and format content such as text, images, and links.",
        "video_url": "https://www.youtube.com/watch?v=pQN-pnXPaVg"
      }
    ],
    "Stiilid": [
      {
        "name": "CSS",
        "description": "CSS (Cascading Style Sheets) is a stylesheet language used to describe the presentation of a document written in HTML or XML. CSS describes how elements should be rendered on screen, on paper, in speech, or on other media.",
        "video_url": "https://www.youtube.com/watch?v=yfoY53QXEnI"
      }
    ],
    "Raamistikud": [
      {
        "name": "React",
        "description": "React is a JavaScript library for building user interfaces. It allows developers to create large web applications that can update and render efficiently in response to data changes.",
        "video_url": "https://www.youtube.com/watch?v=Ke90Tje7VS0"
      }
    ]
  },
  "fullstack": {
    "Keeled": [
      {
        "name": "JavaScript",
        "description": "JavaScript is a versatile, high-level programming language primarily used for adding interactivity and dynamic features to websites. It runs in the browser, allowing for client-side scripting that can manipulate HTML and CSS, respond to user events, and interact with web APIs. JavaScript is also used on the server side with environments like Node.js, enabling full-stack development.",
        "video_url": "https://www.youtube.com/watch?v=hdI2bqOjy3c"
      }
    ],
    "Raamistikud": [
      {
        "name": "Node.js",
        "description": "Node.js is a JavaScript runtime built on Chrome's V8 JavaScript engine. It allows developers to use JavaScript to write server-side code, enabling full-stack development with a single programming language.",
        "video_url": "https://www.youtube.com/watch?v=TlB_eWDSMt4"
      }
    ],
    "Andmebaasid": [
      {
        "name": "MongoDB",
        "description": "MongoDB is a NoSQL database that uses JSON-like documents with optional schemas. It is known for its scalability and flexibility, making it a popular choice for modern web applications.",
        "video_url": "https://www.youtube.com/watch?v=FwMwO8pXfq0"
      }
    ]
  }
}